src/Catalogs/рнсРазделыОбщихНастроек/рнсРазделыОбщихНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсРазделыОбщихНастроек</name>
  <predefined>
    <items>
      <name>ЗначенияПоУмолчанию</name>
      <description>Значения по умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСекцииРаздела</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКлючНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормыЗаполненияХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Секции</name>
    <attributes>
      <name>Секция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязиПараметровВыбора</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаКлюча</name>
    <attributes>
      <name>ПолеКлюча</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсРазделыОбщихНастроек/Forms/ФормаНастройкиПолейКлюча/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаКлюча = Неопределено;
	
	Если Параметры.Свойство("НастройкаКлюча", НастройкаКлюча) Тогда 		
		
		Для каждого Ит Из НастройкаКлюча Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПолейКлюча.Добавить(), Ит);	
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПолейКлюча

&НаКлиенте
Процедура ТаблицаПолейКлючаПолеКлючаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаПолейКлюча.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда  
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПолеКлюча) Тогда 
			ТекущаяСтрока.Заголовок = ЗаголовокПоля(ТекущаяСтрока.ПолеКлюча);	
		Иначе
			ТекущаяСтрока.Заголовок = "";	
		КонецЕсли;				                                                                                                   
	КонецЕсли;                                  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Завершить(Команда)
	
	Результат = Новый Массив;
	
	Для каждого Ит Из ТаблицаПолейКлюча Цикл
		
		ОписаниеПоля = Новый Структура("ПолеКлюча, Заголовок");
		ЗаполнитьЗначенияСвойств(ОписаниеПоля, Ит);
		
		Результат.Добавить(ОписаниеПоля);	
		
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаголовокПоля(ТипПоля)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипПоля, "Заголовок");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
